#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fabric_policies.aci_fabric_if_pol.if_policy: Refreshing state... [id=uni/infra/hintfpol-link_level_auto]
module.devvie_project_1.data.aci_tenant.common: Reading...
module.fabric_policies.aci_lldp_interface_policy.lldp_policy: Refreshing state... [id=uni/infra/lldpIfP-lldp_policy]
module.tenant_policies.data.aci_tenant.common: Reading...
module.fabric_policies.aci_vlan_pool.devvie_vlan_pool: Refreshing state... [id=uni/infra/vlanns-[devvie_vlan_pool]-static]
module.fabric_policies.aci_lacp_policy.lacp_policy: Refreshing state... [id=uni/infra/lacplagp-lacp_policy_active]
module.tenant_policies.aci_tenant.devvie: Refreshing state... [id=uni/tn-devvie]
module.devvie_project_2.data.aci_tenant.common: Reading...
module.fabric_policies.aci_miscabling_protocol_interface_policy.mcp_policy: Refreshing state... [id=uni/infra/mcpIfP-mcp_policy]
module.devvie_project_1.data.aci_tenant.common: Read complete after 1s [id=uni/tn-common]
module.tenant_policies.data.aci_tenant.common: Read complete after 1s [id=uni/tn-common]
module.fabric_policies.aci_cdp_interface_policy.cdp_policy: Refreshing state... [id=uni/infra/cdpIfP-cdp_policy]
module.devvie_project_2.data.aci_tenant.common: Read complete after 1s [id=uni/tn-common]
module.devvie_project_1.netbox_vlan.vlan: Refreshing state... [id=4]
module.tenant_policies.aci_contract.est: Refreshing state... [id=uni/tn-common/brc-Established]
module.tenant_policies.aci_filter.est: Refreshing state... [id=uni/tn-common/flt-est]
module.tenant_policies.aci_vrf.common: Refreshing state... [id=uni/tn-common/ctx-common]
module.fabric_policies.aci_physical_domain.devvie_physdom: Refreshing state... [id=uni/phys-physdom_devvie]
module.fabric_policies.aci_ranges.vlan_2_50_range: Refreshing state... [id=uni/infra/vlanns-[devvie_vlan_pool]-static/from-[vlan-2]-to-[vlan-50]]
module.devvie_project_1.netbox_prefix.prefix: Refreshing state... [id=3]
module.devvie_project_1.aci_application_profile.devvie_app_profile: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap]
module.tenant_policies.aci_vrf.devvie: Refreshing state... [id=uni/tn-devvie/ctx-devvie]
module.tenant_policies.aci_filter_entry.est: Refreshing state... [id=uni/tn-common/flt-est/e-est]
module.tenant_policies.aci_contract_subject.est: Refreshing state... [id=uni/tn-common/brc-Established/subj-est_subj]
module.fabric_policies.aci_attachable_access_entity_profile.devvie_aaep: Refreshing state... [id=uni/infra/attentp-aaep_devvie]
module.fabric_policies.aci_access_generic.epg_to_aep: Refreshing state... [id=uni/infra/attentp-aaep_devvie/gen-default]
module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_1"]: Refreshing state... [id=uni/infra/funcprof/accbundle-VPC_DEVVIE_1]
module.fabric_policies.aci_leaf_access_bundle_policy_group.devvie["VPC_DEVVIE_2"]: Refreshing state... [id=uni/infra/funcprof/accbundle-VPC_DEVVIE_2]
module.tenant_policies.aci_contract_subject_filter.est: Refreshing state... [id=uni/tn-common/brc-Established/subj-est_subj/rssubjFiltAtt-est]
module.tenant_policies.aci_any.vzany: Refreshing state... [id=uni/tn-devvie/ctx-devvie/any]
module.devvie_project_1.aci_bridge_domain.devvie_bridge_domain: Refreshing state... [id=uni/tn-devvie/BD-vlan_15_bd]
module.devvie_project_1.aci_application_epg.devvie_application_epg: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg]
module.devvie_project_1.aci_epgs_using_function.epg_to_aep_assign: Refreshing state... [id=uni/infra/attentp-aaep_devvie/gen-default/rsfuncToEpg-[uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg]]
module.devvie_project_1.aci_epg_to_contract.provided_contract: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg/rsprov-Established]
module.devvie_project_1.aci_epg_to_domain.net_2_domain: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg/rsdomAtt-[uni/phys-physdom_devvie]]
module.devvie_project_1.aci_subnet.subnet: Refreshing state... [id=uni/tn-devvie/ap-devvie_project_1_ap/epg-devvie_project_1_epg/subnet-[192.168.15.1/24]]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.devvie_project_1.fmc_network_objects.aci_net will be created
  + resource "fmc_network_objects" "aci_net" {
      + id    = (known after apply)
      + name  = "devvie_project_1"
      + type  = (known after apply)
      + value = "192.168.15.0/24"
    }

  # module.devvie_project_2.aci_application_epg.devvie_application_epg will be created
  + resource "aci_application_epg" "devvie_application_epg" {
      + annotation                  = "tag_epg"
      + application_profile_dn      = (known after apply)
      + description                 = "EPG for devvie_project_2"
      + exception_tag               = "0"
      + flood_on_encap              = "disabled"
      + fwd_ctrl                    = (known after apply)
      + has_mcast_source            = "no"
      + id                          = (known after apply)
      + is_attr_based_epg           = "no"
      + match_t                     = "AtleastOne"
      + name                        = "devvie_project_2_epg"
      + name_alias                  = (known after apply)
      + pc_enf_pref                 = "unenforced"
      + pref_gr_memb                = "exclude"
      + prio                        = "unspecified"
      + relation_fv_rs_bd           = (known after apply)
      + relation_fv_rs_cust_qos_pol = (known after apply)
      + shutdown                    = "no"
    }

  # module.devvie_project_2.aci_application_profile.devvie_app_profile will be created
  + resource "aci_application_profile" "devvie_app_profile" {
      + annotation                = "orchestrator:terraform"
      + description               = "devvie_project_2 ap"
      + id                        = (known after apply)
      + name                      = "devvie_project_2_ap"
      + name_alias                = (known after apply)
      + prio                      = (known after apply)
      + relation_fv_rs_ap_mon_pol = (known after apply)
      + tenant_dn                 = "uni/tn-devvie"
    }

  # module.devvie_project_2.aci_bridge_domain.devvie_bridge_domain will be created
  + resource "aci_bridge_domain" "devvie_bridge_domain" {
      + annotation                  = "tag_bd"
      + arp_flood                   = "yes"
      + bridge_domain_type          = "regular"
      + description                 = "Bridge Domain for devvie_project_2"
      + ep_clear                    = "no"
      + ep_move_detect_mode         = (known after apply)
      + host_based_routing          = "no"
      + id                          = (known after apply)
      + intersite_bum_traffic_allow = "yes"
      + intersite_l2_stretch        = "yes"
      + ip_learning                 = "yes"
      + ipv6_mcast_allow            = (known after apply)
      + limit_ip_learn_to_subnets   = "yes"
      + ll_addr                     = (known after apply)
      + mac                         = (known after apply)
      + mcast_allow                 = "no"
      + multi_dst_pkt_act           = "bd-flood"
      + name                        = "vlan_16_bd"
      + name_alias                  = (known after apply)
      + optimize_wan_bandwidth      = "no"
      + relation_fv_rs_bd_to_ep_ret = (known after apply)
      + relation_fv_rs_bd_to_nd_p   = (known after apply)
      + relation_fv_rs_ctx          = "uni/tn-devvie/ctx-devvie"
      + relation_fv_rs_igmpsn       = (known after apply)
      + relation_fv_rs_mldsn        = (known after apply)
      + tenant_dn                   = "uni/tn-devvie"
      + unicast_route               = (known after apply)
      + unk_mac_ucast_act           = "proxy"
      + unk_mcast_act               = "flood"
      + v6unk_mcast_act             = (known after apply)
      + vmac                        = "not-applicable"
    }

  # module.devvie_project_2.aci_epg_to_contract.provided_contract will be created
  + resource "aci_epg_to_contract" "provided_contract" {
      + annotation         = "orchestrator:terraform"
      + application_epg_dn = (known after apply)
      + contract_dn        = "uni/tn-common/brc-Established"
      + contract_type      = "provider"
      + id                 = (known after apply)
      + match_t            = (known after apply)
      + prio               = (known after apply)
    }

  # module.devvie_project_2.aci_epg_to_domain.net_2_domain will be created
  + resource "aci_epg_to_domain" "net_2_domain" {
      + allow_micro_seg       = (known after apply)
      + annotation            = "orchestrator:terraform"
      + application_epg_dn    = (known after apply)
      + binding_type          = (known after apply)
      + custom_epg_name       = (known after apply)
      + delimiter             = (known after apply)
      + encap                 = (known after apply)
      + encap_mode            = (known after apply)
      + epg_cos               = (known after apply)
      + epg_cos_pref          = (known after apply)
      + id                    = (known after apply)
      + instr_imedcy          = (known after apply)
      + lag_policy_name       = (known after apply)
      + netflow_dir           = (known after apply)
      + netflow_pref          = (known after apply)
      + num_ports             = (known after apply)
      + port_allocation       = (known after apply)
      + primary_encap         = (known after apply)
      + primary_encap_inner   = (known after apply)
      + res_imedcy            = (known after apply)
      + secondary_encap_inner = (known after apply)
      + switching_mode        = (known after apply)
      + tdn                   = "uni/phys-physdom_devvie"
      + vmm_allow_promiscuous = (known after apply)
      + vmm_forged_transmits  = (known after apply)
      + vmm_id                = (known after apply)
      + vmm_mac_changes       = (known after apply)
    }

  # module.devvie_project_2.aci_epgs_using_function.epg_to_aep_assign will be created
  + resource "aci_epgs_using_function" "epg_to_aep_assign" {
      + access_generic_dn = "uni/infra/attentp-aaep_devvie/gen-default"
      + annotation        = "orchestrator:terraform"
      + encap             = "vlan-16"
      + id                = (known after apply)
      + instr_imedcy      = (known after apply)
      + mode              = "regular"
      + primary_encap     = (known after apply)
      + tdn               = (known after apply)
    }

  # module.devvie_project_2.aci_subnet.subnet will be created
  + resource "aci_subnet" "subnet" {
      + annotation  = "orchestrator:terraform"
      + ctrl        = (known after apply)
      + description = "This subnet is created by terraform"
      + id          = (known after apply)
      + ip          = "192.168.16.1/24"
      + name_alias  = (known after apply)
      + parent_dn   = (known after apply)
      + preferred   = "no"
      + scope       = [
          + "public",
          + "shared",
        ]
      + virtual     = (known after apply)
    }

  # module.devvie_project_2.fmc_network_objects.aci_net will be created
  + resource "fmc_network_objects" "aci_net" {
      + id    = (known after apply)
      + name  = "devvie_project_2"
      + type  = (known after apply)
      + value = "192.168.16.0/24"
    }

  # module.devvie_project_2.netbox_prefix.prefix will be created
  + resource "netbox_prefix" "prefix" {
      + id      = (known after apply)
      + prefix  = "192.168.16.0/24"
      + status  = "active"
      + vlan_id = (known after apply)
    }

  # module.devvie_project_2.netbox_vlan.vlan will be created
  + resource "netbox_vlan" "vlan" {
      + id     = (known after apply)
      + name   = "devvie_project_2"
      + status = "active"
      + vid    = 16
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: Possibly unsupported Netbox version

  with provider["registry.terraform.io/e-breuninger/netbox"],
  on main.tf line 13, in provider "netbox":
  13: provider "netbox" {

Your Netbox version is v3.7.5. The provider was successfully tested against
the following versions:

  3.7.0

Unexpected errors may occur.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.tfplan"

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*